{
    "navbar_home": "Home",
    "navbar_projects": "Projects",
    "navbar_about": "About",
    "navbar_contact": "Contact",
    "navbar_eye_title": "Government is watching you... fight for your privacy & click me!",

    "home_head_title": "My portfolio || Stefan Bartl (WKDStevie)",
    "home_introduction_headline_2h1_first": "Welcome,",
    "home_introduction_headline_2h1_second": "my name is Stefan.",
    "home_introduction_headline_2h2_first": "I ",
    "home_introduction_headline_2h2_second": "craft web applications.",
    "home_introduction_first_h3": "PURE ENTHUSIASM",
    "home_introduction_first_p": "On this portfolio webpage I give an insight into completed & solid web development projects. When I started programming in 2020, I could not have imagined how much fun and passion this broad field would unleash in me. Always looking for new challenges and their solution, web development for me is enthusiasm for technology supported of ambition and passion.",
    "home_introduction_second_p": "Currently my focus is on CSS/Sass, JavaScript/TypeScript & Cyber-Security, specializing in full-stack web development. Therefore, I primarily refer to projects that deal with these three 'tools'. Partly purely playful, partly with practical use. The Rust language and cyber security are my next big topics.",
    "home_introduction_text_statement": "WITH LOVE FOR SCIENCE, TECHNOLOGY AND PEACE!",

    "contact_head_title": "My Portfolio || Contact",
    "contact_page_title": "Contact",
    "contact_social_media_h": "on social media",
    "contact_send_email_section_h2": "the best way to contact me is via email",

    "about_head_title": "My Portfolio || About",
    "about_page_title": "about me. and this site",
    "about_text_h2_first": "Portfolio",
    "about_text_p_first": "This website is designed as a portfolio for my web development projects. It should give an overview of my skills in the areas of CSS/Sass, JavaScript/TypeScript (incl. frameworks like NextJS) & cyber security, offer a contact and information opportunity for interested parties and also serve as a learning curve archive for myself. Please note that I do not expand older projects with newly learned skills, but - if useful - make a new project out of it. At the moment I'm working intensively on Rust, corresponding projects will follow. I hope you enjoy my work!",
    "about_text_h2_second": "Thanks",
    "about_text_p_second": "On my Github repository you will find a readme file with all the collectives, artists, developers, companies etc... without which I would not have become a web developer. On behalf of this I would like to refer to the 'Odin project'(https://www.theodinproject.com/), which I can highly recommend to all beginners, but also to more experienced web developers and which was a great help to me. In the CSS area, I would like to recommend all web content by Kevin Powell (https://www.youtube.com/kepowob) whose videos and courses have also helped me a lot. Finally, I would like to thank my friends and family, who always support me in my interests and motivate me again and again.",
    "about_text_p_third": "Thank you all from the bottom of my heart !",
    "about_me_final_text_h": "To my person",
    "about_me_final_text_p": "Stefan Bartl lives in Vienna, Austria. Always interested in technology, I landed my first job in the construction industry. After completing an apprenticeship and the first 6 years of work, I switched to union representation in order to realize my socio-political interests and to work with people to build a better future that can only be fought for and worked out together. As a trade unionist, I have many years of project management experience and, in numerous further training courses, skills in many different areas, such as rhetoric/moderation, group dynamics, pedagogy, event management, budget responsibility, economics, politics and much more. can collect and build up a corresponding network. Above all, networked and interdisciplinary activities are a lot of fun for me. Since 2020 I fill most of my free time with courses and further education in the fields of web development and computer science, usually in self-study. Since then I've been gripped by 'developer' fever and look forward to challenging problems and their creative solutions. I am currently looking for a permanent position in the field of web development/IT.Security and am looking forward to the relevant contacts!",
    "about_me_final_text_h3": "In short, the following three and a half words describe me: science, tech & peace(-politics) !",
    "about_me_infobox": "Interested in the code of this website? Click on this text here and you will jump to the Github repository!",
    "about_me_infobox_2": "This website was created using the following web techniques, among others: Github, TypeScript in a functional programming manner, Next.js Framework including specially created components and integration of external components such as the contact option via email.js, full language translation into German/English , CSS/Sass in the responsive flexbox and grid layout (including the use of media queries, transitions, animations, pseudo elements,...), complete backend configuration , hosting and deployment via Vercel. The 'user-following navbar eye' should be mentioned as a particularly creative design element.",
    
    "projects_nextjs_head_title": "My Portfolio || React / Next.js Projects",
    "projects_nextjs_page_title": "React / Next.js Projects",
    "projects_nextjs_intro": "Since 2022, after I got involved in web frontend and Javascript development, I started to deal intensively with the back-end. In the world of server-side development, countless possibilities and projects open up. Hosting, Databases, Internet infrastructure or file systems are some of the terms that are involved here. Since I like working with React and Next.js, I have specialized in these technologies. Selected projects are presented here.",
    "projects_nextjs_mmcardgame_project_h2": "Memory-Card Memo Game",
    "projects_nextjs_mmcardgame_project_p": "Memorize 10 cards as quickly as possible! Click on them one after the other as quickly as possible, but not twice - then you start over! My first real React project!",
    "projects_nextjs_mmcardgame_project_link": "3, 2, 1 - remember and click!",
    
    "project_top_head_title": "My Portfolio || The Odin Project",
    "project_top_intro": "is an online curriculum to learn the basics of HTML, CSS (Flexbox, Grid, ...) Javascript, React,js, Node.js, etc... The focus is strongly on the self-acquired knowledge as well as applying the skills learned through project work. TOP personally helped me a lot to work my way into software-development and architecture. Here you will find selected works of mine: I have intentionally included simple projects to illustrate the learning experience. I highly recommend everyone who wants to learn software development or just enjoys solving tasks in the field of web technologies to take a closer look at this website. Hardest recommendation!",
    "project_top_etch_h2": "Etch - a - Sketch",
    "project_top_etch_p": "Etch A Sketch™ is a variant of the magic board and was particularly popular as a toy in the 1970s. The project tries to imitate the original in such a way that it is cool to play and integrates some useful features such as a free choice of color or adjustable resolution. The project was a lot of fun in the development: Above all, dealing with CSS grid and event control with Javascript were particularly instructive !",
    "project_top_etch_link": "Try the magic board!",
    "project_top_fourwins_h2": "4-IN-A-ROW",
    "project_top_fourwins_p": "This was my first project for which I took the time to expand it comprehensively according to my ideas: As a user you can freely choose the size of the playing field, swap stone colors, statistics and settings such as name or language are saved, series games are possible, a winning animation is integrated and and and... In addition, it is responsive and you can also play it on mobile devices! All this required a very extensive examination of numerous front-end development topics. I would be very happy if you try it out - have fun !",
    "project_top_fourwins_link": "Wanna play a round 4-in-a-row ?",
    "project_top_tictactoe_h2": "TIC-TAC-TOE",
    "project_top_tictactoe_p": "The world-famous 'Tic-Tac-Toe' is fun to play in almost every situation and is also a good boredom breaker. Making an online version required my first exposure to programming a gaming AI that - once done - didn't seem like a lame drunk at 3am. Due to the significantly smaller number of game options, it was a very good preparation for the '4-in-a-row' project, of which it is the little sister. Especially the less high complexity and the resulting faster game can often be attractive and just the right thing! Will you be able to beat the computer ?",
    "project_top_tictactoe_link": "3-in-a-row is always worth it!",
    "project_top_rps_h2": "ROCK-PAPER-SCISSORS",
    "project_top_rps_p": "Who doesn't know it? Popular with young and old - sometimes played for fun, but sometimes also to play something important! The programming itself was totally fun and exciting, a good random algorithm was the goal and was found. Do you want to know if you know more lucky than the machine in front of you ?",
    "project_top_rps_link": "Let's give it a try!",

    "top_link_title": "Click to jump to 'The Odin Project'!",
    "projects_link_title": "Click to jump to the project!",
    "toGithubRepository": "Click to jump to the Github-Repository of the application!",
    "github_link_title_portfolio_nextjs": "Click to jump to the Github-Repository of the Portfolio-Website!",
    "under_construction": "Under construction, will be ready soon!"
}