{
    "navbar_home": "Home",
    "navbar_projects": "Projekte",
    "navbar_about": "Über",
    "navbar_contact": "Kontakt",
    "navbar_eye_title": "Government is watching you... kämpfe für deinen Datenschutz und klick mich!",

    "home_head_title": "Mein Portfolio || Stefan Bartl (WKDStevie)",
    "home_introduction_headline_2h1_first": "Willkommen,",
    "home_introduction_headline_2h1_second": "mein Name ist Stefan.",
    "home_introduction_headline_2h2_first": "Ich ",
    "home_introduction_headline_2h2_second": "entwickle Web-Applikationen.",
    "home_introduction_first_h3": "PURER ENTHUSIASMUS",
    "home_introduction_first_p": "Auf dieser Portfolio-Seite gebe ich einen Einblick in abgeschlossene, solide Webentwicklungsprojekte. Als ich 2020 mit dem Programmieren anfing, konnte ich mir nicht vorstellen, wie viel Spaß und Leidenschaft dieses breite Feld in mir auslösen würde. Immer auf der Suche nach neuen Herausforderungen und deren Lösung, ist Webentwicklung für mich Technikbegeisterung getragen von Ehrgeiz und Leidenschaft.",
    "home_introduction_second_p": "Aktuell liegt mein Fokus auf CSS/Sass, JavaScript/TypeScript & Cyber-Security, spezialisiert auf Fullstack-Webentwicklung. Daher verweise ich hier vordergründig auf Projekte, die sich mit diesen drei 'Werkzeugen' beschäftigen. Teils rein spielerisch, teils mit praktischem Nutzen. Die Sprache Rust und Cyber-Security sind meine nächsten großen Themenbereiche.",
    "home_introduction_text_statement": "WITH LOVE FOR SCIENCE, TECHNOLOGY AND PEACE!",

    "contact_head_title": "Mein Portfolio || Kontakt",
    "contact_page_title": "Kontakt",
    "contact_social_media_h": "über social media",
    "contact_send_email_section_h2": "der beste Weg mich zu kontaktieren ist via email",

    "about_head_title": "Mein Portfolio || About",
    "about_page_title": "über mich. und diese Seite",
    "about_text_h2_first": "Portfolio",
    "about_text_p_first": "Diese Webseite ist als Portfolio für meine Webentwicklungsprojekte konzipiert. Es soll einen Überblick über meine Fähigkeiten in den Bereichen CSS/Sass, JavaScript/TypeScript (inkl. Frameworks wie NextJS) & Cyber-Security geben, eine Kontakt- und Informationsmöglichkeit für Interresierte bieten und auch als Lernkurvenarchiv für mich selbst dienen. Bitte beachten Sie, dass ich ältere Projekte nicht mit neu erlernten Fähigkeiten erweitere, sondern - sofern sinnvoll - ein neues Projekt daraus mache. Zurzeit beschäftige ich mich intensiv mit der Rust, enstrpechende Projekte werden folgen. Ich hoffe, Sie genießen meine Arbeit!",
    "about_text_h2_second": "Danke",
    "about_text_p_second": "Auf meinem Github-Repository finden Sie eine Readme-Datei mit allen Kollektiven, Künstlern, Entwicklern, Unternehmen usw. ... ohne die ich kein Webentwickler geworden wäre. Stellvertretend dafür möchte ich auf das 'Odin-Projekt'(https://www.theodinproject.com/) verweisen, das ich allen Anfängern, aber auch erfahreneren Webentwicklern sehr empfehlen kann und mir eine große Hilfe war. Im Bereich CSS möchte ich alle Webinhalte von Kevin Powell (https://www.youtube.com/kepowob) empfehlen, dessen Videos und Kurse mir ebenfalls sehr geholfen haben. Abschließend möchte ich mich ganz herzlich bei meinen Freunden und meiner Familie bedanken, die mich immer wieder in meinen Interessen unterstützen und mich aufs Neue motivieren.",
    "about_text_p_third": "Ich danke euch allen von ganzen Herzen !",
    "about_me_final_text_h": "Zu meiner Person",
    "about_me_final_text_p": "Stefan Bartl, lebt in Wien, Österreich. Schon immer technisch interessiert, landete ich mit meinem erster Job in der Baubranche. Nach einer absolvierten Lehre und den ersten 6 Berufsjahren wechselte ich in die gewerkschaftliche Interessenvertretung um meine gesellschaftspolitischen Interessen zu verwirklichen und mit den Menschen an einer besseren Zukunft zu bauen, die sich nur gemeinsam erkämpfen und erarbeiten lässt. Als Gewerkschafter habe ich mehrjährige Projektmanagementerfahrung und in zahlreiche Weiterbildungen Fertigkeiten in vielen verschiedenen Bereichen, wie etwa Rhetorik/Moderation, Gruppendynamik, Pädagogik, Veranstaltungsmanagement, Budgetverantwortung, Wirtschaftslehre, Politik uvm. sammeln und ein entsprechendes Netzwerk aufbauen können. Vor allem vernetze und interdisziplinäre Tätigkeiten bereiten mir großen Spaß. Seit 2020 fülle ich den Großteil meiner Freizeit mit Kursen und Weiterbildungen in den Bereichen Webentwicklung und Computerwissenschaft aus, in der Regel im Selbststudium. Seitdem bin ich vom „Developer“-Fieber gepackt und freue mich auf herausfordernde Problemstellungen & derer kreativen Lösung. Zurzeit suche ich eine Festanstellung im Bereich Webentwicklung/IT.Security und freue mich über enstprechende Kontakte!",
    "about_me_final_text_h3": "Kurzum beschreiben mich diese 3 1/2 Worte am besten: Wissenschaft, Technik & Frieden(-spolitik) !",
    "about_me_infobox": "Interesse am Code dieser Website? Klicke auf diesen Text hier und du springst zum Github-Repository!",
    "about_me_infobox_2": "Diese Website wurde unter anderem mit folgenden Web-Techniken erstellt: Github, TypeScript in funktionaler Programmierweise, Next.js Framework ínklusive eigens erstellten Komponenten sowie Einbindung externer Komponententen wie die Kontaktmöglichkeit vie email.js, voller Sprachübersetzung in Deutsch/Englisch, CSS/Sass im responsiven Flexbox sowie Grid-Layout (unter anderem mit Anwendung von Media Queries, Transitions, Animationen, Pseudoelementen,...), vollständiger Backend-Konfiguration, Hosting und Deployment via Vercel. Als speziell kreatives Designelement ist das 'Benutzer verfolgende Navbar-Auge' zu nennen.",
    
    "projects_nextjs_head_title": "Mein Portfolio || React / Next.js Projekte",
    "projects_nextjs_page_title": "React / Next.js Projekte",
    "projects_nextjs_intro": "Seit 2022, also nachdem ich in die Webfrontend- und Javascript-Entwicklung eingestiegen bin, habe ich begonnen, mich intensiv mit dem Back-End zu beschäftigen. In der Welt der serverseitigen Entwicklung eröffnen sich unzählige Möglichkeiten und Projekte. Hosting, Datenbanken, Internetinfrastruktur oder Dateisysteme sind einige Begriffe um die es hier geht. Da ich gerne mit React und Next.js arbeite, habe ich mich auf diese Technologien spezialisiert. Ausgewählte Projekte werden hier vorgestellt.",
    "projects_nextjs_mmcardgame_project_h2": "Memory-Card Memo Game",
    "projects_nextjs_mmcardgame_project_p": "Lerne so schnell wie möglich 10 Karten auswendig! Klicke sie diese so schnell wie möglich nacheinander an, aber nicht zweimal, denn beginnt man wieder von vrone! Mein erstes richtiges React-Projekt!",
    "projects_nextjs_mmcardgame_project_link": "3, 2, 1 - merken und klicken!",

    "project_top_head_title": "Mein Portfolio || The Odin Projekt",    
    "project_top_intro": "ist ein Online-Curriculum zum Erlernen der Grundlagen von HTML, CSS (Flexbox, Grid, ...) Javascript, React,js, Node.js, etc... Der Fokus liegt stark auf dem selbst erworbenen Wissen sowie der Anwendung der durch Projektarbeit erlernte Fähigkeiten. TOP hat mir persönlich sehr geholfen, mich in die Softwareentwicklung und -architektur einzuarbeiten. Hier finden Sie ausgewählte Arbeiten von mir: Ich habe bewusst einfache Projekte eingefügt, um die Lernerfahrung zu veranschaulichen. Ich empfehle jedem, der Softwareentwicklung lernen möchte oder einfach nur Spaß daran hat, Aufgaben im Bereich Webtechnologien zu lösen, sich diese Website einmal genauer anzusehen. Es ist die Mühe wert!",
    "project_top_etch_h2": "Etch - a - Sketch",
    "project_top_etch_p": "Etch A Sketch™ ist eine Variante des Zauberbretts und war besonders in den 1970er Jahren als Spielzeug beliebt. Das Projekt versucht das Original so nachzuahmen, dass es cool zu spielen ist und integriert einige nützliche Features wie eine freie Farbwahl oder einstellbare Auflösung. Das Projekt hat in der Entwicklung sehr viel Spaß gemacht: Vor allem der Umgang mit CSS-Grid und Event-Steuerung mit Javascript waren besonders lehrreich !",
    "project_top_etch_link": "Probieren Sie das Zauberbrett aus!",
    "project_top_fourwins_h2": "4 - Gewinnt!",
    "project_top_fourwins_p": "Das war mein erstes Projekt, für das ich mir die Zeit genommen habe, es umfassend nach meinen Vorstellungen zu erweitern: Als Nutzer kann man die Größe des Spielfelds frei wählen, Steinfarben tauschen, Statistiken und Einstellungen wie Name oder Sprache werden gespeichert, Serien Spiele sind möglich, eine Gewinnanimation ist integriert und und und... Außerdem ist es responsiv und man kann es auch auf mobilen Geräten spielen! All dies erforderte eine sehr umfangreiche Auseinandersetzung mit zahlreichen Frontend-Entwicklungsthemen. Ich würde mich sehr freuen, wenn du es ausprobierst - viel Spaß!",
    "project_top_fourwins_link": "Lust auf eine Runde 4-Gewinnt?",
    "project_top_tictactoe_h2": "TIC-TAC-TOE",
    "project_top_tictactoe_p": "Das weltberühmte 'Tic-Tac-Toe' macht in fast jeder Situation Spaß und ist auch ein guter Langeweilebrecher. Um eine Online-Version zu erstellen, musste ich zum ersten Mal mit der Programmierung einer Gaming-KI in Berührung kommen, die – einmal fertig – um 3 Uhr morgens nicht wie ein lahmer Betrunkener aussah. Aufgrund der deutlich geringeren Anzahl an Spielmöglichkeiten war es eine sehr gute Vorbereitung auf das „4-Gewinnt“-Spiel. Projekt, dessen kleine Schwester es ist. Gerade die weniger hohe Komplexität und das daraus resultierende schnellere Spiel kann oft attraktiv und genau das Richtige sein! Werden Sie in der Lage sein, den Computer zu schlagen?",
    "project_top_tictactoe_link": "3-Gewinnt lohnt sich immer!",
    "project_top_rps_h2": "STEIN-SCHERE-PAPIER",
    "project_top_rps_p": "Wer kennt es nicht? Beliebt bei Jung und Alt - mal zum Spaß gespielt, mal aber auch um etwas Wichtiges zu spielen! Das Programmieren an sich hat total Spaß gemacht und war spannend, ein guter Zufallsalgorithmus war das Ziel und wurde gefunden. Möchten Sie wissen, ob Sie mehr Glück haben als die Maschine vor Ihnen?",
    "project_top_rps_link": "Probieren Sie es aus!",

    "top_link_title": "Klicke um zu 'The Odin Project' zu springen!",
    "projects_link_title": "Klicke um zum Projekt zu springen!",
    "toGithubRepository": "Klicke um zum Github-Repository der Anwendung zu springen!",
    "github_link_title_portfolio_nextjs": "Klicke um zum Github-Repository der Portfolio-Website zu springen!",
    "under_construction": "In kürze verfügbar!"

    
}